# 0. Data Load

In [3]:
import pandas as pd
import numpy as np

In [16]:
#data_url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/housing/housing.data'
#df = pd.read_csv(data_url, sep='\s+', header=None)
#df.to_csv("housing.csv", index=False)

df = pd.read_csv('housing.csv')
df.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222.0,18.7,396.90,5.33,36.2

# 1. Series

### 1) Series 생성하기

In [19]:
pd.Series?

In [ ]:
data = [2, 4, 6, 8, 10]
series = pd.Series(data)
series

In [39]:
data = [2, 4, 6, 8, 10]
idx = ['a', 'b', 'c', 'd', 'e']
series = pd.Series(data, dtype=np.float64, index=idx)
series

a     2.0
b     4.0
c     6.0
d     8.0
e    10.0
dtype: float64

### 2) Series 데이터 접근/할당

In [40]:
series

a     2.0
b     4.0
c     6.0
d     8.0
e    10.0
dtype: float64

In [41]:
series['c']

6.0

In [42]:
series.values

array([ 2.,  4.,  6.,  8., 10.])

In [43]:
series.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [35]:
series['c'] = 'c'

In [36]:
series

a     2
b     4
c     c
d     8
e    10
dtype: object

### 3) 인덱서 loc, iloc

In [22]:
data = pd.Series(['a', 'b', 'c', 'd'], 
                 index = [1, 3, 5, 7])
data

1    a
3    b
5    c
7    d
dtype: object

#### 3-1. 인덱싱할 때 명시적인 인덱스 사용

In [23]:
data[3]

'b'

In [25]:
data.loc[1:3]

1    a
3    b
dtype: object

#### 3-2. 슬라이싱할 때 암묵적 인덱스를 사용

In [24]:
data[1:3]

3    b
5    c
dtype: object

In [26]:
data.iloc[1:3]

3    b
5    c
dtype: object

# 2. DataFrame

### 1) DataFrame 생성하기

In [47]:
pd.DataFrame?

In [61]:
raw_data = {'name' : ['Lee', 'Kim', 'Park'],
            'age'  : [23, 62, 35],
            'city' : ['Seoul', 'Jeju', 'Boston']}

df = pd.DataFrame(raw_data)
df

   age    city  name
0   23   Seoul   Lee
1   62    Jeju   Kim
2   35  Boston  Park

In [74]:
raw_data = [['Lee', 23, 'Seoul'],
            ['Kim,', 62, 'Jeju'],
            ['Park', 35, 'Boston']]
cols = ['name', 'age', 'city']
idx  = ['a', 'b', 'c']
            
df = pd.DataFrame(raw_data, columns=cols, index=idx)
df

   name  age    city
a   Lee   23   Seoul
b  Kim,   62    Jeju
c  Park   35  Boston

### 2) Data 접근

In [56]:
df.name

0     Lee
1     Kim
2    Park
Name: name, dtype: object

In [53]:
df['name']

0     Lee
1     Kim
2    Park
Name: name, dtype: object

In [57]:
type(df['name'])

pandas.core.series.Series

In [54]:
df[['name', 'city']]

   name    city
0   Lee   Seoul
1   Kim    Jeju
2  Park  Boston

In [58]:
type(df[['name', 'city']])

pandas.core.frame.DataFrame

### 3) 신규 컬럼 추가 및 데이터 할당

In [101]:
raw_data = [['Lee', 23, 'Seoul'],
            ['Kim,', 62, 'Jeju'],
            ['Park', 35, 'Boston']]
cols = ['name', 'age', 'city']
            
df = pd.DataFrame(raw_data, columns=cols)
df

   name  age    city
0   Lee   23   Seoul
1  Kim,   62    Jeju
2  Park   35  Boston

In [102]:
df['debt'] = 0
df.debt = df.age > 40
df

   name  age    city   debt
0   Lee   23   Seoul  False
1  Kim,   62    Jeju   True
2  Park   35  Boston  False

### 4) DataFrame 인덱싱/슬라이싱

In [30]:
raw_data = [['Lee', 23, 'Seoul'],
            ['Kim', 62, 'Jeju'],
            ['Park', 35, 'Boston']]
cols = ['name', 'age', 'city']
idx  = [1, 5, 3]
            
df = pd.DataFrame(raw_data, columns=cols, index=idx)
df

   name  age    city
1   Lee   23   Seoul
5   Kim   62    Jeju
3  Park   35  Boston

#### 4-1. loc는 명시적 인덱스를 참조하는 인덱싱과 슬라이싱 가능

In [29]:
df.loc[3]

name      Park
age         35
city    Boston
Name: 3, dtype: object

In [32]:
df.loc[:5, ['name', 'age']]

  name  age
1  Lee   23
5  Kim   62

#### 4-2. iloc는 인덱싱과 슬라이싱에서 암묵적으로 인덱스를 참조

In [33]:
df.iloc[2]

name      Park
age         35
city    Boston
Name: 3, dtype: object

In [35]:
df.iloc[:2, :2]

  name  age
1  Lee   23
5  Kim   62

### 5) DataFrame 데이터 선택

In [64]:
raw_data = [['Lee', 23, 'Seoul'],
            ['Kim', 62, 'Jeju'],
            ['Park', 35, 'Boston']]
cols = ['name', 'age', 'city']
idx = [1, 5, 3]

df = pd.DataFrame(raw_data, columns=cols, index=idx)

   name  age    city
1   Lee   23   Seoul
5   Kim   62    Jeju
3  Park   35  Boston

#### 5-1. Column 명으로 데이터 선택

In [65]:
df['name']

1     Lee
5     Kim
3    Park
Name: name, dtype: object

#### 5-2. column명 없이 사용하는 index number는 row 기준

In [66]:
df[:2]

  name  age   city
1  Lee   23  Seoul
5  Kim   62   Jeju

#### 5-3. column명과 함께 row index 사용하여 데이터 선택

In [67]:
df['name'][:2]

1    Lee
5    Kim
Name: name, dtype: object

In [68]:
df[:2]['name']

1    Lee
5    Kim
Name: name, dtype: object

In [69]:
df[['name', 'city']][:2]

  name   city
1  Lee  Seoul
5  Kim   Jeju

###### loc는 명시적 인덱스를 참조하는 인덱싱과 슬라이싱 가능

In [70]:
df.loc[:3, ['name','city']]

   name    city
1   Lee   Seoul
5   Kim    Jeju
3  Park  Boston

#### iloc는 인덱싱과 슬라이싱에서 암묵적으로 인덱스를 참조

In [71]:
df.iloc[:2, :2]

  name  age
1  Lee   23
5  Kim   62

### 6) Del, Drop

In [89]:
raw_data = [['Lee', 23, 'Seoul'],
            ['Kim', 62, 'Jeju'],
            ['Park', 35, 'Boston']]
cols = ['name', 'age', 'city']
idx = ['name', 'age', 'city']

df = pd.DataFrame(raw_data, columns=cols, index=idx)
df

      name  age    city
name   Lee   23   Seoul
age    Kim   62    Jeju
city  Park   35  Boston

#### 6-1. del

In [90]:
del df['name']
df

      age    city
name   23   Seoul
age    62    Jeju
city   35  Boston

#### 6-2. drop (index, column 지정 - axis 설정)

In [91]:
df.drop('age', axis=1)

        city
name   Seoul
age     Jeju
city  Boston

In [92]:
df.drop('age', axis=0)

      age    city
name   23   Seoul
city   35  Boston

In [93]:
# [주의] drop 후, df를 출력해도 데이터가 삭제되지 않음 ! 
df

      age    city
name   23   Seoul
age    62    Jeju
city   35  Boston

In [94]:
# inplace=True 수행 시, df이 수정됨
df.drop('age', axis=1, inplace=True)
df

        city
name   Seoul
age     Jeju
city  Boston